# Taps
tap "felixkratz/formulae"
tap "nikitabobko/homebrew-tap"

# Core CLI
brew "git"
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "wget"
brew "bat"
brew "chafa"
brew "htop"
brew "yazi"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "tree-sitter"
brew "graphviz"
brew "direnv"
brew "mas"
brew "stow"  # keeping around in case useful

# Shell
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Build tools
brew "gcc"
brew "ccache"
brew "ninja"
brew "pkg-config"
brew "autoconf"
brew "automake"
brew "jpegoptim"
brew "llvm"        # replaces nix llvm; sets DRJIT_LIBLLVM_PATH
brew "rustup-init"

# Languages / runtimes
brew "uv"          # Python packaging
brew "nodejs"      # via npm ecosystem

# Graphics / rendering
brew "assimp"
brew "tbb"
brew "spdlog"
brew "glfw"
brew "imagemagick"
brew "pngpaste"
brew "poppler"

# Dev environment
brew "devenv"

# macOS UI / WM
brew "sketchybar"
brew "borders"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-source-code-pro"

# Apps
cask "nikitabobko/tap/aerospace"
cask "warp"
cask "ghostty"
cask "slack"
cask "signal"
cask "zoom"
cask "loom"
cask "discord"
cask "obsidian"
cask "zotero"
cask "thunderbird"
cask "raycast"
cask "keycastr"
cask "jetbrains-toolbox"
cask "docker"
cask "visual-studio-code"
cask "cmake"
cask "godot"
cask "tev"
cask "anki"
