tap "felixkratz/formulae"
tap "nikitabobko/tap"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Object-file caching compiler wrapper
brew "ccache"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Multi-platform library for OpenGL applications
brew "glfw"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Super fast C++ logging library
brew "spdlog"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Terminal multiplexer
brew "tmux"
# Incremental parsing library
brew "tree-sitter"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Family of tools to build, test and package software
cask "cmake-app"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# 2D and 3D game engine
cask "godot"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualiser
cask "keycastr"
# Screen and video recording software
cask "loom"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop client for Proton Pass
cask "proton-pass"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# High dynamic range (HDR) image viewer with accurate color management
cask "tev"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Developer", id: 640199958
mas "Goodnotes", id: 1444383602
mas "keymapp", id: 6472865291
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Xcode", id: 497799835
vscode "1000ch.svgo"
vscode "a2k.hlsl-preview"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alimozdemir.vscode-nuxt-dx-tools"
vscode "almenon.arepl"
vscode "amandeepmittal.pug"
vscode "amiralizadeh9480.cpp-helper"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "arrterian.nix-env-selector"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bananaacid.compile-superhero"
vscode "batisteo.vscode-django"
vscode "bierner.comment-tagged-templates"
vscode "boyswan.glsl-literal"
vscode "bradlc.vscode-tailwindcss"
vscode "brboer.vsc-conceal"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "ckolkman.vscode-postgres"
vscode "corvofeng.vsnips"
vscode "cschlosser.doxdocgen"
vscode "dariofuzinato.vue-peek"
vscode "dbaeumer.vscode-eslint"
vscode "dfranx.shadered"
vscode "docker.docker"
vscode "donjayamanne.python-extension-pack"
vscode "draivin.hscopes"
vscode "draivin.hsnips"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtoplak.vscode-glsllint"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "ekelley.midnight-synth"
vscode "enkia.tokyo-night"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "fill-labs.dependi"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "franneck94.c-cpp-runner"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hars.cppsnippets"
vscode "idleberg.icon-fonts"
vscode "jacqueslucke.blender-development"
vscode "james-yu.latex-workshop"
vscode "jasonnutter.search-node-modules"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeremyrajan.webpack"
vscode "jnoortheen.nix-ide"
vscode "jock.svg"
vscode "kaangokdemir.vue-pug-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "kleinicke.tiff-visualizer"
vscode "leizongmin.node-module-intellisense"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "magicstack.magicpython"
vscode "mateocerquetella.xcode-12-theme"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mathematic.vscode-pdf"
vscode "max-ss.cyberpunk"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "modular-mojotools.vscode-mojo"
vscode "modular-mojotools.vscode-mojo-nightly"
vscode "mrmlnc.vscode-autoprefixer"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mubaidr.vuejs-extension-pack"
vscode "naumovs.color-highlight"
vscode "ngtystr.ppm-pgm-viewer-for-vscode"
vscode "njpwerner.autodocstring"
vscode "nuxt.mdc"
vscode "nuxtr.nuxtr-vscode"
vscode "nvidia.nsight-vscode-edition"
vscode "octref.vetur"
vscode "orangex4.latex-sympy-calculator"
vscode "oxc.oxc-vscode"
vscode "phgn.vscode-starlark"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "ryanabx.godot-vscode-theme"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "sdras.vue-vscode-snippets"
vscode "shader-slang.slang-language-extension"
vscode "shyykoserhiy.vscode-spotify"
vscode "skengrek.synth-wave--84---python-edition"
vscode "slevesque.shader"
vscode "stevensona.shader-toy"
vscode "stiansivertsen.visualclojure"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "sundragontech.awaken-the-synth-dragon"
vscode "svelte.svelte-vscode"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "timgjones.hlsltools"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "wscats.eno"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "zeshuaro.vscode-python-poetry"
vscode "zignd.html-css-class-completion"
uv "marimo[recommended]"
uv "ruff"
